000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. OBTAININPUT.
000300
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NAME PIC A(20).
       
000400 PROCEDURE DIVISION.
000500   DISPLAY 'Please enter your name: '.
         ACCEPT NAME.
         DISPLAY "It is nice to meet you, " NAME.
000600 STOP RUN.
       END PROGRAM OBTAININPUT.

      
      